In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('./customer_data.csv')

In [16]:
df

  attended_college under_thirty    borough    income  customer
0                ?          Yes  Manhattan      < 55         0
1              Yes          Yes   Brooklyn      < 55         0
2                ?           No   Brooklyn      < 55         1
3               No           No     Queens     > 100         1
4                ?           No     Queens  55 - 100         1
5              Yes           No  Manhattan     > 100         0
6              Yes           No     Queens     > 100         0
7              Yes          Yes   Brooklyn  55 - 100         1

In [17]:
df.sort_values('attended_college')[['attended_college', 'customer']]

  attended_college  customer
0                ?         0
2                ?         1
4                ?         1
3               No         1
1              Yes         0
5              Yes         0
6              Yes         0
7              Yes         1

In [18]:
df.loc[1, 'attended_college'] = 'No'

In [23]:
df.sort_values('attended_college')

  attended_college under_thirty    borough    income  customer
0                ?          Yes  Manhattan      < 55         0
2                ?           No   Brooklyn      < 55         1
4                ?           No     Queens  55 - 100         1
1               No          Yes   Brooklyn      < 55         0
3               No           No     Queens     > 100         1
5              Yes           No  Manhattan     > 100         0
6              Yes           No     Queens     > 100         0
7              Yes          Yes   Brooklyn  55 - 100         1

In [26]:
df.loc[6].to_list()

['Yes', 'No', 'Queens', '> 100', 0]

In [29]:
cols = df.columns
df_2 = pd.DataFrame([['Yes', 'No', 'Queens', '> 100', 0]],columns = cols)
df_2

  attended_college under_thirty borough income  customer
0              Yes           No  Queens  > 100         0

In [32]:
mixed_df = df.append(df_2)

In [33]:
mixed_df.to_csv('./mixed_customers.csv')